# CwpAddGridSuffix Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CwpAddGridSuffix Property
ParameterTypeId Class See Also
---
"Add suffix to Grid Name"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CwpAddGridSuffix { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CwpAddGridSuffix As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CwpAddGridSuffix {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace